public class Main {
    public static void main(String[] args) {
        // if 語法 :
        /*
            if (敘述表達式){
                如果敘述表達式成立，則會執行此區塊程式
            }
         */

        // if...else... 語法 :
        /*
            if (敘述表達式){
                如果敘述表達式成立，則會執行此區塊程式
            }else{
                如果敘述表達式不成立，則會執行此區塊程式
            }
         */

        // if 多條件判斷控制 :
        /*
            if (敘述表達式){
                如果敘述表達式成立，則會執行此區塊程式
            }else if (敘述表達式){
                如果敘述表達式成立，則會執行此區塊程式
            }else{
                如果所有敘述表達式不成立，則會執行此區塊程式
            }
         */
    }
}
